# Этап 1: Собираем бинарник (Builder)
# Берем официальный образ Go (версия alpine - самая легкая)
FROM golang:1.26.1-alpine AS builder

# Создаем рабочую папку внутри контейнера
WORKDIR /app

# Копируем go.mod и скачиваем зависимости (если бы они были)
COPY go.mod ./
RUN go mod download

# Копируем весь наш код в контейнер
COPY . .

# Компилируем приложение. Получаем файл с названием "shortener"
RUN go build -o shortener .

# Этап 2: Финальный образ (Runner)
# Нам больше не нужен компилятор Go в продакшене, берем чистую пустую ОС!
FROM alpine:latest
WORKDIR /app

# Забираем только готовый бинарник из первого этапа
COPY --from=builder /app/shortener .

# Говорим, что наш контейнер слушает порт 8080
EXPOSE 8080

# Команда для запуска нашего сервера
CMD ["./shortener"]